RockySong/micropython-rocky/ports/nxp_lpc546/sdk22/middleware/usb_1.7.0/device/usb_device_lpcip3511.c
/*******************************************************************************
 * Variables
 ******************************************************************************/
/* define the reserved buffer for endpoint max packet copy */
#if (USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY == 1U)
USB_GLOBAL USB_RAM_ADDRESS_ALIGNMENT(64) uint32_t
    s_EpReservedBuffer1[USB_DEVICE_IP3511_ENDPOINT_RESERVED_BUFFER_SIZE >> 2];
#define LPC_CONTROLLER_RESERVED_BUFFER_ARRAY \
    {                                        \
        &s_EpReservedBuffer1[0]              \
    }
#elif(USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY == 2U)
USB_GLOBAL USB_RAM_ADDRESS_ALIGNMENT(64) uint32_t
    s_EpReservedBuffer1[USB_DEVICE_IP3511_ENDPOINT_RESERVED_BUFFER_SIZE >> 2];
USB_GLOBAL USB_RAM_ADDRESS_ALIGNMENT(64) uint32_t
    s_EpReservedBuffer2[USB_DEVICE_IP3511_ENDPOINT_RESERVED_BUFFER_SIZE >> 2];
#define LPC_CONTROLLER_RESERVED_BUFFER_ARRAY             \
    {                                                    \
        &s_EpReservedBuffer1[0], &s_EpReservedBuffer2[0] \
    }
#else
#error "increase the instance count."
#endif

/* LPC3511IP controller driver instances and endpoint command/status list, EPLISTSTART's value is the buffer pointer. */
#if ((USB_DEVICE_CONFIG_LPCIP3511FS + USB_DEVICE_CONFIG_LPCIP3511HS) == 1U)
USB_GLOBAL USB_RAM_ADDRESS_ALIGNMENT(256) static uint32_t
    s_EpCommandStatusList1[((USB_DEVICE_CONFIG_ENDPOINTS + 0x03U) & 0xFFFFFFFCU) * 4];
#define LPC_CONTROLLER_ENDPOINT_LIST_ARRAY \
    {                                      \
        &s_EpCommandStatusList1[0]         \
    }

USB_GLOBAL USB_RAM_ADDRESS_ALIGNMENT(64) static usb_device_lpc3511ip_state_struct_t s_UsbDeviceLpc3511IpState1;
#define LPC_CONTROLLER_INSTANCE_ARRAY \
    {                                 \
        &s_UsbDeviceLpc3511IpState1   \
    }
#elif((USB_DEVICE_CONFIG_LPCIP3511FS + USB_DEVICE_CONFIG_LPCIP3511HS) == 2U)
USB_GLOBAL USB_RAM_ADDRESS_ALIGNMENT(256) static uint32_t
    s_EpCommandStatusList1[((USB_DEVICE_CONFIG_ENDPOINTS + 0x03U) & 0xFFFFFFFCU) * 4];
USB_GLOBAL USB_RAM_ADDRESS_ALIGNMENT(256) static uint32_t
    s_EpCommandStatusList2[((USB_DEVICE_CONFIG_ENDPOINTS + 0x03U) & 0xFFFFFFFCU) * 4];
#define LPC_CONTROLLER_ENDPOINT_LIST_ARRAY                     \
    {                                                          \
        &s_EpCommandStatusList1[0], &s_EpCommandStatusList2[0] \
    }

USB_GLOBAL USB_RAM_ADDRESS_ALIGNMENT(64) static usb_device_lpc3511ip_state_struct_t s_UsbDeviceLpc3511IpState1;
USB_GLOBAL USB_RAM_ADDRESS_ALIGNMENT(64) static usb_device_lpc3511ip_state_struct_t s_UsbDeviceLpc3511IpState2;
#define LPC_CONTROLLER_INSTANCE_ARRAY                            \
    {                                                            \
        &s_UsbDeviceLpc3511IpState1, &s_UsbDeviceLpc3511IpState2 \
    }
#else
#error "increase the instance count."
#endif

#if (defined USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY)
#if (USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY == (USB_DEVICE_CONFIG_LPCIP3511FS + USB_DEVICE_CONFIG_LPCIP3511HS))
#define USB_DEVICE_IP3511_ALL_IP_SUPPORT_RESERVED_BUFFER 1u
#elif((USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY == USB_DEVICE_CONFIG_LPCIP3511FS) && (!USB_DEVICE_CONFIG_LPCIP3511HS))
#define USB_DEVICE_IP3511_ALL_IP_SUPPORT_RESERVED_BUFFER 1u
#elif((USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY == USB_DEVICE_CONFIG_LPCIP3511HS) && (!USB_DEVICE_CONFIG_LPCIP3511FS))
#define USB_DEVICE_IP3511_ALL_IP_SUPPORT_RESERVED_BUFFER 1u
#else
#define USB_DEVICE_IP3511_ALL_IP_SUPPORT_RESERVED_BUFFER 0u
#endif

#else
#define USB_DEVICE_IP3511_ALL_IP_SUPPORT_RESERVED_BUFFER 0u

#endif

/*******************************************************************************
 * Code
 ******************************************************************************/
#if (defined USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY) && (USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY)

static inline uint8_t USB_DeviceLpcIp3511MaxPacketNeedCopy(usb_device_lpc3511ip_state_struct_t *lpc3511IpState)
{
#if (USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY == (USB_DEVICE_CONFIG_LPCIP3511HS + USB_DEVICE_CONFIG_LPCIP3511FS))
    return 1u;
#elif(USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY == USB_DEVICE_CONFIG_LPCIP3511HS)
    return (lpc3511IpState->controllerSpeed);
#elif(USB_DEVICE_IP3511_RESERVED_BUFFER_FOR_COPY == USB_DEVICE_CONFIG_LPCIP3511FS)
#if (defined USB_DEVICE_CONFIG_LPCIP3511HS) && (USB_DEVICE_CONFIG_LPCIP3511HS)
    if (lpc3511IpState->controllerSpeed)
    {
        return 0u;
    }
    else
    {
        return 1u;
    }
#else
    return 1u;
#endif
#endif
}

static uint8_t *USB_DeviceLpcIp3511MallocMaxPacketBuffer(usb_device_lpc3511ip_state_struct_t *lpc3511IpState,
                                                         uint32_t multile64)
{
    uint32_t bitsIndex;
    uint8_t numIndex;
    USB_OSA_SR_ALLOC();

    multile64 = ((multile64 + 63) / 64);
    bitsIndex = 0;
    USB_OSA_ENTER_CRITICAL();
    do
    {
        numIndex = 0;
        for (; numIndex < multile64; ++numIndex)
        {
            if (bitsIndex >= USB_DEVICE_IP3511_BITS_FOR_RESERVED_BUFFER)
            {
                USB_OSA_EXIT_CRITICAL();
                return NULL; /* fail */
            }
            if (lpc3511IpState->epReservedBufferBits[(bitsIndex / 8)] &
                (uint8_t)(0x01u << (bitsIndex & 0x00000007u))) /* has allocated */
            {
                bitsIndex++;
                break;
            }
            bitsIndex++;
        }
    } while (numIndex < multile64);

    if (numIndex >= multile64)
    {
        /* set the bits */
        for (numIndex = 0; numIndex < multile64; ++numIndex)
        {
            lpc3511IpState->epReservedBufferBits[((bitsIndex - multile64 + numIndex) / 8)] |=
                (uint8_t)(0x01u << ((bitsIndex - multile64 + numIndex) & 0x00000007u));
        }
        USB_OSA_EXIT_CRITICAL();
        return lpc3511IpState->epReservedBuffer + ((bitsIndex - multile64) * 64);
    }
    else
    {
        USB_OSA_EXIT_CRITICAL();
        return NULL;
    }
}

static void USB_DeviceLpcIp3511ReleaseMaxPacketBuffer(usb_device_lpc3511ip_state_struct_t *lpc3511IpState,
                                                      uint8_t *buffer,
                                                      uint32_t bufferSize)
{
    uint32_t bitsIndex;
    uint8_t bitsNum;
    USB_OSA_SR_ALLOC();

