RockySong/micropython-rocky/ports/nxp_lpc546/sdk22/middleware/usb_1.7.0/device/usb_device_lpcip3511.c
    usbErrorCode = (lpc3511IpState->registerBase->INFO & USB_INFO_ERR_CODE_MASK);

    /* device status change interrupt */
    if (interruptStatus & USB_INTSTAT_DEV_INT_MASK)
    {
        /* get and clear device state change status */
        devState = lpc3511IpState->registerBase->DEVCMDSTAT;
        lpc3511IpState->registerBase->DEVCMDSTAT |= USB_LPC3511IP_DEVCMDSTAT_INTERRUPT_WC_MASK;

        /* reset change */
        if (devState & USB_DEVCMDSTAT_DRES_C_MASK)
        {
            USB_DeviceLpc3511IpInterruptReset(lpc3511IpState);
        }

#if (defined(USB_DEVICE_CONFIG_DETACH_ENABLE) && (USB_DEVICE_CONFIG_DETACH_ENABLE))
        /* dis-connect change */
        if (devState & USB_DEVCMDSTAT_DCON_C_MASK)
        {
            USB_DeviceLpc3511IpInterruptDetach(lpc3511IpState);
        }
#endif

/* Suspend/Resume */
#if ((defined(USB_DEVICE_CONFIG_LOW_POWER_MODE)) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))
        if (devState & USB_DEVCMDSTAT_DSUS_C_MASK)
        {
            if (lpc3511IpState->registerBase->DEVCMDSTAT & USB_DEVCMDSTAT_DSUS_MASK)
            {
                USB_DeviceLpc3511IpInterruptSuspend(lpc3511IpState);
            }
            else
            {
                USB_DeviceLpc3511IpInterruptResume(lpc3511IpState);
            }
        }
#if (defined(USB_DEVICE_CONFIG_LPM_L1) && (USB_DEVICE_CONFIG_LPM_L1 > 0U))
        if (devState & USB_DEVCMDSTAT_DSUS_C_MASK)
        {
            if (lpc3511IpState->registerBase->DEVCMDSTAT & USB_DEVCMDSTAT_LPM_SUS_MASK)
            {
                USB_DeviceLpc3511IpInterruptLPMSleep(lpc3511IpState);
            }
            else
            {
                USB_DeviceLpc3511IpInterruptResume(lpc3511IpState);
            }
        }
#endif

#endif

#if 0U /* some soc don't support this bit, need check according to the feature macro */
        /* OTG Status change */
        if (lpc3511IpState->registerBase->DEVCMDSTAT & USB_DEVCMDSTAT_OTG_C_MASK)
        {
        }
#endif
    }

    /* endpoint transfers interrupt */
    if (interruptStatus & USB_LPC3511IP_MAX_PHY_ENDPOINT_MASK)
    {
        devState = 0;                /* devState means index here */
        if (interruptStatus & 0x01u) /* control OUT */
        {
            if (lpc3511IpState->registerBase->DEVCMDSTAT & USB_DEVCMDSTAT_SETUP_MASK)
            {
                devState = 2;
                if ((lpc3511IpState->endpointState1[0].stateUnion.stateBitField.stalled == 1U) ||
                    (lpc3511IpState->endpointState1[1].stateUnion.stateBitField.stalled == 1U))
                {
                    USB_LPC3511IP_ENDPOINT_SET_ENDPOINT_AND(
                        lpc3511IpState, 0, 0,
                        (~(USB_LPC3511IP_ENDPOINT_STALL_MASK | USB_LPC3511IP_ENDPOINT_ACTIVE_MASK)));
                    USB_LPC3511IP_ENDPOINT_SET_ENDPOINT_AND(
                        lpc3511IpState, 1, 0,
                        (~(USB_LPC3511IP_ENDPOINT_STALL_MASK | USB_LPC3511IP_ENDPOINT_ACTIVE_MASK)));
                    lpc3511IpState->endpointState1[0].stateUnion.stateBitField.stalled = 0U;
                    lpc3511IpState->endpointState1[1].stateUnion.stateBitField.stalled = 0U;
                }

                /* todo: setup token interrupt */
                USB_DeviceLpc3511IpInterruptToken(lpc3511IpState, 0U, 1, usbErrorCode);
            }
        }

        for (; devState < (USB_DEVICE_CONFIG_ENDPOINTS * 2); ++devState)
        {
            /* check the endpoint interrupt */
            if (interruptStatus & (0x01U << devState))
            {
                USB_DeviceLpc3511IpInterruptToken(lpc3511IpState, devState, 0, usbErrorCode);
            }
        }
    }

#if 0U
    if (interruptStatus & USB_INTSTAT_FRAME_INT_MASK)
    {
    }
#endif
}

#endif
